# Practicing Skills - Python Pandas

* Author: Cleiber Garcia
* Version's date: March, 2023

* Pourpose: Practicing skills - Python Pandas

* This Notebook was produced as part of my studies of the course 'Python for Data Science and Machine Learning Bootcamp', taught by Mr Jose Portilla, Head of Data Science at Pierian Training. The course is offered ad Udemy (https://www.udemy.com/course/python-for-data-science-and-machine-learning-bootcamp/learn/lecture/5784218?start=15#overview). 

* Although the degree of similarity between this notebook I produced, and the notebook written by the instructor containing the solutions of the respective exercices is almost 100%, I assure you that I wrote it line by line. The differences between them are due the fact that I put my colours while writing it
* For more information, please contact me at cleiber.garcia@gmail.com

## 1. SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

###  1.1. Import pandas as pd

In [78]:
import pandas as pd

### 1.2. Read Salaries.csv as a dataframe called sal

In [79]:
# I will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle
sal = pd.read_csv('Salaries.csv')

C:\Users\PC-IO\AppData\Local\Temp\ipykernel_4260\3252814068.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries.csv')

### 1.3. Check the head of the DataFrame

In [80]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### 1.4. Use the .info() method to find out how many entries there are

In [81]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

### 1.5. What is the average BasePay ?

In [ ]:
# Since the data type of BasePay is object (string), first is necessary to convert it to float.
# But the column BasePay have values 'Not Provided' and NaN, so I first converted these value to zero.

In [95]:
# Convert non-numeric and NaN values to zero
mapping = {'Not Provided': 0, 'NaN': 0}

sal.replace({'BasePay': mapping}, inplace=True)

In [96]:
# Convert column BasePay's values from string to float
sal['BasePay'] = sal['BasePay'].astype('float64')

In [97]:
sal.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

In [98]:
sal['BasePay'].mean()

66323.65685410085

### 1.6. What is the highest amount of OvertimePay in the dataset ?

In [100]:
# Convert non-numeric and NaN values to zero
mapping = {'Not Provided': 0, 'NaN': 0}
sal.replace({'OvertimePay': mapping}, inplace=True)

In [102]:
# Convert column OvertimePay's values from string to float
sal['OvertimePay'] = sal['OvertimePay'].astype('float64')

In [103]:
sal['OvertimePay'].max()

245131.88

### 1.7. What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll)

In [107]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [108]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

### 1.8. How much does JOSEPH DRISCOLL make (including benefits)?

In [109]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

### 1.9. What is the name of highest paid person (including benefits)?

In [115]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [116]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

### 1.10. What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [120]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [122]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [ ]:
# What I noticed strange is that TotalPayBenefits' value is negative

### 1.11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [127]:
# Grouping rows together by Year
sal.groupby('Year')

In [128]:
# Calculating the average (mean)
sal.groupby('Year').mean()

,Id,BasePay,OvertimePay,TotalPay,TotalPayBenefits,Notes
Year,,,,,,
2011,18080.0,63595.956517,4531.065429,71744.103871,71744.103871,NaN
2012,54542.5,65436.406857,5023.417824,74113.262265,100553.229232,NaN
2013,91728.5,69630.030216,5281.641980,77611.443142,101440.519714,NaN
2014,129593.0,66557.437750,5401.426941,75463.918140,100250.918884,NaN

In [130]:
# Showing the BasePay's values for 2011-2014
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66557.437750
Name: BasePay, dtype: float64

### 1.12. How many unique job titles are there?

In [132]:
sal['JobTitle'].nunique()

2159

### 1.13. What are the top 5 most common jobs?

In [138]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

### 1.14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [202]:
sal[sal['Year'] == 2013]['JobTitle']

72925                    Chief of Police
72926             Chief, Fire Department
72927     Battalion Chief, Fire Suppress
72928                  Asst Med Examiner
72929       Dep Dir for Investments, Ret
                       ...
110526           PS Aide Health Services
110527                      Senior Clerk
110528                  Police Officer 3
110529                  Police Officer 3
110530                  Police Officer 3
Name: JobTitle, Length: 37606, dtype: object

In [200]:
sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1

Transit Operator                  False
Special Nurse                     False
Registered Nurse                  False
Public Svc Aide-Public Works      False
Custodian                         False
                                  ...
Sr General Utility Mechanic        True
Sprv Adult Prob Ofc (SFERS)        True
Mayoral Staff XII                  True
Pr Investigator, Tax Collector     True
Senior Assessment Clerk            True
Name: JobTitle, Length: 1051, dtype: bool

In [201]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

### 1.15. How many people have the word Chief in their job title? (This is pretty tricky)

In [214]:
def verify_title(title):
    return ('chief' in title.lower())

sum(sal['JobTitle'].apply(verify_title))

627

In [213]:
# Solution of the instructor
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False
    
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

627

### 1.16. Bonus: Is there a correlation between length of the Job Title string and Salary?

In [236]:
# Calculate the title's length
def calc_length(title):
    return len(title)

title_length = sal['JobTitle'].apply(calc_length) # Calculate the title's length for eache title's value

sal['TotalPayBenefits'].corr(title_length) # Calculate the correlation between TotalPayBenefits and title_length

-0.03687844593260667

In [237]:
# Instructor's solution

sal['title_len'] = sal['JobTitle'].apply(len) # set a column with title length
sal[['title_len','TotalPayBenefits']].corr()  # calculate the correlations between columns title_len and TotalPayBenefits

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [238]:
# There is no correlation between TotalPayBenefits and JobTitle values

## 2. Ecommerce Purchases Exercise

* In this Exercise you will be given some Fake Data about some purchases done through Amazon! Just go ahead and follow the directions and try your best to answer the questions and complete the tasks. 
* Most of the tasks can be solved in different ways. For the most part, the questions get progressively harder. 
* All the data in the DataFrame is fake and made-up.

### 2.1 Import pandas and read in the Ecommerce Purchases csv file and set it to a DataFrame called ecom

In [1]:
# Importing Pandas module
import pandas as pd

In [2]:
ecom = pd.read_csv('Ecommerce Purchases.csv')

**Check the head of the DataFrame.**

In [3]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

### 2.2 How many rows and columns are there?

In [4]:
ecom.shape # There are 10,000 rows and 14 columns

(10000, 14)

In [5]:
# Show column's names and respective quantity and data types
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

### 2.3 What is the average Purchase Price?

In [6]:

ecom['Purchase Price'].mean()

50.34730200000025

### 2.4 What were the highest and lowest purchase prices?

In [251]:
# Show the highest Purchase Price
ecom['Purchase Price'].max()

99.99

In [252]:
# Show the lowest Purchase Price
ecom['Purchase Price'].min()

0.0

### 2.5 How many people have English 'en' as their Language of choice on the website?

In [255]:
sum(ecom['Language'] == 'en')

1098

### 2.6 How many people have the job title of "Lawyer" ?

In [259]:
sum(ecom['Job'] == 'Lawyer')

30

### 2.7 How many people made the purchase during the AM and how many people made the purchase during PM ?

**(Hint: Check out [value_counts()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html) ) **

In [261]:
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

### 2.8 What are the 5 most common Job Titles?

In [264]:
ecom['Job'].value_counts().head(5)

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Purchasing manager               27
Designer, jewellery              27
Name: Job, dtype: int64

### 2.9 Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction?

In [270]:
# Show entire row for Lot equal '90 WT'
ecom[ecom['Lot'] == '90 WT']

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
513,"50398 Mccoy Rest Suite 597\nSouth Garyborough,...",90 WT,AM,Mozilla/5.0 (iPod; U; CPU iPhone OS 3_2 like M...,Bright PLC,630438419693,11/19,173,American Express,jesse00@page.net,Energy engineer,156.70.208.94,ru,75.1

In [271]:
# Show the Purchase Price for Lot equal '90 WT'
ecom[ecom['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

### 2.10 What is the email of the person with the following Credit Card Number: 4926535242672853

In [275]:
ecom[ecom['Credit Card'] == 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

### 2.11 How many people have American Express as their Credit Card Provider *and* made a purchase above $95 ?

In [326]:
mask1 = (ecom['CC Provider'] == 'American Express')

In [327]:
mask2 = (ecom['Purchase Price'] > 95)

In [328]:
ecom[mask1 & mask2].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

In [ ]:
# Instructor's solution
ecom[(ecom['CC Provider']=='American Express') & (ecom['Purchase Price']>95)].count()

### 2.12 Hard: How many people have a credit card that expires in 2025?

In [353]:
def get_year(date):
    return (date.split("/")[1] == '25')


sum(ecom['CC Exp Date'].apply(get_year))

1033

In [354]:
# Instructor's solution
sum(ecom['CC Exp Date'].apply(lambda x: x[3:] == '25'))

1033

### 2.13 Hard: What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...)

In [355]:
def get_provider(email):
    return email.split("@")[1]

ecom['Email'].apply(get_provider).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

In [356]:
# Instructor's solution
ecom['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64